GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32w51x_f5hcr(i)xx-pinctrl.h
/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF1)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)
#define TIMER2_CH0_PD0 \
	GD32_PINMUX_AF('D', 0, AF10)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)
#define TIMER2_CH1_PD1 \
	GD32_PINMUX_AF('D', 1, AF10)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER2_CH2_PC4 \
	GD32_PINMUX_AF('C', 4, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)
#define TIMER2_CH2_PD2 \
	GD32_PINMUX_AF('D', 2, AF10)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB2 \
	GD32_PINMUX_AF('B', 2, AF3)
#define TIMER2_CH3_PC5 \
	GD32_PINMUX_AF('C', 5, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF12)
#define TIMER3_CH0_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER3_CH0_PD3 \
	GD32_PINMUX_AF('D', 3, AF12)
#define TIMER3_CH0_PD5 \
	GD32_PINMUX_AF('D', 5, AF12)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PB10 \
	GD32_PINMUX_AF('B', 10, AF3)

/* TIMER3_ETI */
#define TIMER3_ETI_PB10 \
	GD32_PINMUX_AF('B', 10, AF2)
#define TIMER3_ETI_PC8 \
	GD32_PINMUX_AF('C', 8, AF12)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PC2 \
	GD32_PINMUX_AF('C', 2, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PC3 \
	GD32_PINMUX_AF('C', 3, AF2)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PA4 \
	GD32_PINMUX_AF('A', 4, AF4)
#define TIMER4_CH2_PC0 \
	GD32_PINMUX_AF('C', 0, AF12)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)
#define TIMER4_CH3_PA5 \
	GD32_PINMUX_AF('A', 5, AF7)
#define TIMER4_CH3_PC1 \
	GD32_PINMUX_AF('C', 1, AF12)

/* TRACECK */
#define TRACECK_PC6 \
	GD32_PINMUX_AF('C', 6, AF0)

/* TRACED0 */
#define TRACED0_PB6 \
	GD32_PINMUX_AF('B', 6, AF0)

/* TRACED1 */
#define TRACED1_PB7 \
	GD32_PINMUX_AF('B', 7, AF0)

/* TRACED2 */
#define TRACED2_PB8 \
	GD32_PINMUX_AF('B', 8, AF0)

/* TRACED3 */
#define TRACED3_PB9 \
	GD32_PINMUX_AF('B', 9, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* USART0_CK */
#define USART0_CK_PA2 \
	GD32_PINMUX_AF('A', 2, AF0)
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)
#define USART0_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)
#define USART0_CK_PC14 \
	GD32_PINMUX_AF('C', 14, AF0)

/* USART0_CTS */
#define USART0_CTS_PA13 \
	GD32_PINMUX_AF('A', 13, AF7)
#define USART0_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF12)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)
#define USART0_RTS_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)
#define USART0_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF12)

/* USART0_RX */
#define USART0_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF0)
#define USART0_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF2)
#define USART0_RX_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define USART0_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)
#define USART0_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF12)
#define USART0_RX_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART0_TX */
#define USART0_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF0)
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF12)
#define USART0_TX_PB15 \
	GD32_PINMUX_AF('B', 15, AF8)
#define USART0_TX_PC8 \
	GD32_PINMUX_AF('C', 8, AF7)
#define USART0_TX_PD3 \
	GD32_PINMUX_AF('D', 3, AF7)
#define USART0_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)

/* USART1_CK */
#define USART1_CK_PA3 \
	GD32_PINMUX_AF('A', 3, AF0)
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define USART1_CK_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define USART1_CK_PC14 \
	GD32_PINMUX_AF('C', 14, AF1)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)
#define USART1_CTS_PA13 \
	GD32_PINMUX_AF('A', 13, AF8)
#define USART1_CTS_PC2 \
	GD32_PINMUX_AF('C', 2, AF13)
#define USART1_CTS_PC13 \
	GD32_PINMUX_AF('C', 13, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_RTS_PA14 \
	GD32_PINMUX_AF('A', 14, AF8)
#define USART1_RTS_PC3 \
	GD32_PINMUX_AF('C', 3, AF13)
#define USART1_RTS_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define USART1_RX_PA5 \
	GD32_PINMUX_AF('A', 5, AF0)
#define USART1_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)
#define USART1_RX_PC1 \
	GD32_PINMUX_AF('C', 1, AF0)
#define USART1_RX_PD1 \
	GD32_PINMUX_AF('D', 1, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define USART1_TX_PA4 \
	GD32_PINMUX_AF('A', 4, AF0)
#define USART1_TX_PB15 \
	GD32_PINMUX_AF('B', 15, AF7)
#define USART1_TX_PC0 \
	GD32_PINMUX_AF('C', 0, AF0)
#define USART1_TX_PD0 \
	GD32_PINMUX_AF('D', 0, AF7)

/* USART2_CK */
#define USART2_CK_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)

/* USART2_CTS */
#define USART2_CTS_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF7)

/* USART2_RTS */
#define USART2_RTS_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define USART2_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)

/* USART2_RX */
#define USART2_RX_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)
#define USART2_RX_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define USART2_RX_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)

/* USART2_TX */
#define USART2_TX_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF7)
#define USART2_TX_PC6 \
	GD32_PINMUX_AF('C', 6, AF10)

/* USBFS_DM */
#define USBFS_DM_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)

/* USBFS_DP */
#define USBFS_DP_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)

/* USBFS_ID */
#define USBFS_ID_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)
#define USBFS_ID_PD3 \
	GD32_PINMUX_AF('D', 3, AF10)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)
#define USBFS_SOF_PC8 \
	GD32_PINMUX_AF('C', 8, AF10)

/* WKUP0 */
#define WKUP0_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* WKUP1 */
#define WKUP1_PA15 \
	GD32_PINMUX_AF('A', 15, ANALOG)

/* WKUP2 */
#define WKUP2_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)

/* WKUP3 */
#define WKUP3_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)

/* WKUP4 */
#define WKUP4_PD5 \
	GD32_PINMUX_AF('D', 5, ANALOG)

/* WKUP5 */
#define WKUP5_PD4 \
	GD32_PINMUX_AF('D', 4, ANALOG)

/* WKUP6 */
#define WKUP6_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* WKUP7 */
#define WKUP7_PD3 \
	GD32_PINMUX_AF('D', 3, ANALOG)
